performance/metrics/CANN8.5/20260115/test_ascend_qwen3_32b_w8a8_2p_in3k5_out1k5_50ms.txt
Image: swr.cn-southwest-2.myhuaweicloud.com/base_image/dockerhub/lmsysorg/sglang:cann8.5-a3-release20260114
deep-ep                   1.0.0+86da4c53.cann.8.5.0.b200
sgl-kernel-npu            2026.1.12
sglang                    0.5.6.post2
sglang-router             0.3.1
torch                     2.8.0+cpu
torch_npu                 2.8.0.post2.dev20251226
torchao                   0.9.0
torchvision               0.23.0
transformers              4.57.1
CANN: version=8.5.0
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=21000, dataset_name='random', dataset_path='', model='/root/.cache/modelscope/hub/models/aleoyang/Qwen3-32B-w8a8-MindIE', served_model_name=None, tokenizer=None, num_prompts=312, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3500, random_output_len=1500, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=78, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_id=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=21000, dataset_name='random', dataset_path='', model='/root/.cache/modelscope/hub/models/aleoyang/Qwen3-32B-w8a8-MindIE', served_model_name=None, tokenizer=None, num_prompts=312, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3500, random_output_len=1500, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=78, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_id=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 1092000
#Output tokens: 468000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 78        
Successful requests:                     312       
Benchmark duration (s):                  274.86    
Total input tokens:                      1092000   
Total input text tokens:                 1092000   
Total input vision tokens:               0         
Total generated tokens:                  468000    
Total generated tokens (retokenized):    467505    
Request throughput (req/s):              1.14      
Input token throughput (tok/s):          3972.95   
Output token throughput (tok/s):         1702.69   
Peak output token throughput (tok/s):    3387.00   
Peak concurrent requests:                82        
Total token throughput (tok/s):          5675.65   
Concurrency:                             70.05     
Accept length:                           2.82      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   61708.81  
Median E2E Latency (ms):                 58001.74  
---------------Time to First Token----------------
Mean TTFT (ms):                          3934.12   
Median TTFT (ms):                        430.77    
P99 TTFT (ms):                           19539.63  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.54     
Median TPOT (ms):                        36.19     
P99 TPOT (ms):                           65.97     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           38.54     
Median ITL (ms):                         20.54     
P95 ITL (ms):                            88.34     
P99 ITL (ms):                            183.58    
Max ITL (ms):                            12635.19  
==================================================